<html xmlns:ng="http://docbook.org/docbook-ng"><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1082; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; Find The Pair</title><meta name="generator" content="DocBook XSL Stylesheets V1.79.2"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article"><div class="titlepage"><div><div><h2 class="title"><a name="d6e1"></a>&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1082; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091; Find The Pair</h2></div><div><div class="authorgroup">
            <div class="author"><h3 class="author"><span class="firstname">&#1042;&#1083;&#1072;&#1076;&#1072;</span> <span class="surname">&#1052;&#1072;&#1084;&#1091;&#1090;&#1086;&#1074;&#1072;</span></h3></div>
        </div></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="section"><a href="#d6e8">&#1054; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;</a></span></dt><dt><span class="section"><a href="#d6e13">&#1054;&#1073; &#1080;&#1075;&#1088;&#1077;</a></span></dt><dt><span class="section"><a href="#d6e16">&#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</a></span></dt><dt><span class="section"><a href="#d6e25">&#1044;&#1077;&#1090;&#1072;&#1083;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;</a></span></dt><dd><dl><dt><span class="section"><a href="#d6e28">&#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1081;&#1084;&#1077;&#1088;&#1072; &#1080;&#1075;&#1088;&#1099;</a></span></dt><dt><span class="section"><a href="#d6e32">&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1082;&#1083;&#1080;&#1082;&#1072; &#1087;&#1086; &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1082;&#1077;</a></span></dt><dt><span class="section"><a href="#d6e36">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1085;&#1072; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1077;&#1082;</a></span></dt><dt><span class="section"><a href="#d6e40">&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1103; &#1080;&#1075;&#1088;&#1099;</a></span></dt></dl></dd></dl></div>
    
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d6e8"></a>&#1054; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;</h2></div></div></div>
        
        <p>&#1048;&#1075;&#1088;&#1072; "&#1053;&#1072;&#1081;&#1076;&#1080; &#1087;&#1072;&#1088;&#1091;" &#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1100; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100; &#1082; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1085;&#1080;&#1102;, &#1074;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;
            &#1089;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;.</p>
        <p>&#1048;&#1075;&#1088;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1086;&#1085;&#1083;&#1072;&#1081;&#1085;: <a class="ulink" href="https://vladamamutova.github.io/find-the-pair/" target="_top">
                https://vladamamutova.github.io/find-the-pair/</a>.</p>
    </div>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d6e13"></a>&#1054;&#1073; &#1080;&#1075;&#1088;&#1077;</h2></div></div></div>
        
        <p> &#1048;&#1075;&#1088;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1095;&#1105;&#1090;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1077;&#1082;, &#1087;&#1086;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1080; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1087;&#1072;&#1088;&#1099; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1093;
            &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1086;&#1082;. &#1055;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; &#1080;&#1075;&#1088;&#1099; &#1087;&#1086;&#1083;&#1077; &#1089; &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1082;&#1072;&#1084;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076; &#1080;
            &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086; &#1089;&#1085;&#1086;&#1074;&#1072;. &#1055;&#1086;&#1089;&#1090;&#1072;&#1088;&#1072;&#1081;&#1089;&#1103; &#1079;&#1072;&#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1086;&#1082;! &#1050;&#1083;&#1080;&#1082;&#1072;&#1081; &#1087;&#1086; &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1082;&#1072;&#1084;,
            &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1081;, &#1095;&#1090;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1086; &#1089; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1080; &#1080;&#1097;&#1080; &#1087;&#1072;&#1088;&#1099;. 
            &#1062;&#1077;&#1083;&#1100; &#1080;&#1075;&#1088;&#1099; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;
            &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1085;&#1072;&#1081;&#1090;&#1080; &#1074;&#1089;&#1077; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077; &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1082;&#1080; &#1085;&#1072; &#1080;&#1075;&#1088;&#1086;&#1074;&#1086;&#1084; &#1087;&#1086;&#1083;&#1077;. 
        </p>
    </div>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d6e16"></a>&#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;</h2></div></div></div>
        
        <div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1086;&#1082; &#1076;&#1083;&#1103; &#1087;&#1086;&#1074;&#1099;&#1096;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1075;&#1088;&#1099;;</li><li class="listitem">&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1086;&#1082; &#1085;&#1072; 2 &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086;&#1084; &#1080;&#1075;&#1088;&#1099; &#1076;&#1083;&#1103; &#1080;&#1093; &#1083;&#1091;&#1095;&#1096;&#1077;&#1075;&#1086; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1085;&#1080;&#1103;;</li><li class="listitem">&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1080;&#1075;&#1088;&#1091; &#1085;&#1072; &#1087;&#1072;&#1091;&#1079;&#1091; &#1080; &#1089;&#1086;&#1073;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1084;&#1099;&#1089;&#1083;&#1103;&#1084;&#1080;;</li><li class="listitem">&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080;&#1075;&#1088;&#1086;&#1074;&#1086;&#1075;&#1086; &#1089;&#1095;&#1105;&#1090;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1087;&#1088;&#1086;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1080;&#1075;&#1088;&#1099; &#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1085;&#1099;&#1081;
            &#1096;&#1072;&#1075;&#1086;&#1074;;</li><li class="listitem">&#1071;&#1088;&#1082;&#1080;&#1077; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1080; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1103;&#1088;&#1082;&#1080;&#1093; &#1079;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;;</li><li class="listitem">&#1040;&#1076;&#1072;&#1087;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085; &#1076;&#1083;&#1103; &#1080;&#1075;&#1088;&#1099; &#1082;&#1072;&#1082; &#1089; &#1084;&#1086;&#1073;&#1080;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1090;&#1072;&#1082; &#1080; &#1089; &#1076;&#1077;&#1089;&#1082;&#1090;&#1086;&#1087;&#1072;.</li></ul></div>
    </div>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d6e25"></a>&#1044;&#1077;&#1090;&#1072;&#1083;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;</h2></div></div></div>
        
        <p>&#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1085;&#1080;&#1078;&#1077;:</p>
        <div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d6e28"></a>&#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1081;&#1084;&#1077;&#1088;&#1072; &#1080;&#1075;&#1088;&#1099;</h3></div></div></div>
            
            <p>&#1044;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1095;&#1105;&#1090;&#1095;&#1080;&#1082;&#1072; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; setInterval, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1082;&#1072;&#1078;&#1076;&#1091;&#1102;
                &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1091; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1085;&#1077; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; &#1083;&#1080; &#1080;&#1075;&#1088;&#1072; &#1085;&#1072; &#1087;&#1072;&#1091;&#1079;&#1091;, &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1080;&#1085;&#1091;&#1090; &#1080;
                &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1082;&#1079;&#1072;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; Vue &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1102;&#1090; &#1101;&#1090;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072;
                &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072;.</p>
            <pre class="programlisting">
    let sec = 0;
    let min = 0;
    game.timerHandle = setInterval(function() {
        if (game.isStarted) {
            sec++;
            if (sec &gt; 60){
                min++;
                sec = 0;
            }
            game.result.min = (min &lt; 10) ? "0" + min : min;
            game.result.sec = (sec &lt; 10) ? "0" + sec : sec;
        }
    }, 1000);
                </pre>
        </div>
        <div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d6e32"></a>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1082;&#1083;&#1080;&#1082;&#1072; &#1087;&#1086; &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1082;&#1077;</h3></div></div></div>
            
            <p>&#1050;&#1083;&#1080;&#1082; &#1087;&#1086; &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1082;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1080;&#1075;&#1088;&#1072; &#1085;&#1077; &#1089;&#1090;&#1086;&#1080;&#1090; &#1085;&#1072; &#1087;&#1072;&#1091;&#1079;&#1077;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;
                &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1082;&#1072; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1082;&#1072;&#1088;&#1090;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1095;&#1080;&#1089;&#1083;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093;
                &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1077;&#1082; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1072;&#1077;&#1090; &#1076;&#1074;&#1091;&#1093;, &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1084; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1080; &#1085;&#1072; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077;. </p>
            <pre class="programlisting">
    if (!game.isStarted) return;
    if (e.target.parentElement.classList.contains("card") &amp;&amp;
        e.target.parentElement.classList.contains("close") &amp;&amp;
        game.openCards.length &lt; 2){
        const card = e.target.parentElement;
        card.classList.toggle("close");
        game.openCards.push(card);
    }
    if (game.openCards.length == 2){
        checkForMatches();
     }
                </pre>
        </div>
        <div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d6e36"></a>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1085;&#1072; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093; &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1077;&#1082;</h3></div></div></div>
            
            <p>&#1050;&#1072;&#1088;&#1090;&#1086;&#1095;&#1082;&#1080; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1084;&#1091; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1101;&#1090;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1055;&#1088;&#1080; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1084; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1080;
                &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1095;&#1080;&#1089;&#1083;&#1086; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1081;, &#1087;&#1088;&#1080; &#1085;&#1077;&#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1084; - &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1082;&#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;.</p>
            <pre class="programlisting">
    if (game.openCards[0].innerHTML != game.openCards[1].innerHTML){
        game.openCards[0].classList.toggle("close");
        game.openCards[1].classList.toggle("close");
    } else {
        game.matchesNumber += 2;
    }
    game.openCards = [];
    game.result.moves++;
                </pre>

        </div>
        <div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d6e40"></a>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1103; &#1080;&#1075;&#1088;&#1099;</h3></div></div></div>
            
            <p>&#1050;&#1086;&#1075;&#1076;&#1072; &#1074;&#1089;&#1077; &#1087;&#1072;&#1088;&#1099; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1099; (&#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1081; &#1088;&#1072;&#1074;&#1085;&#1086; &#1095;&#1080;&#1089;&#1083;&#1091; &#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1077;&#1082;), &#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084;
                &#1080;&#1075;&#1088;&#1091;, &#1086;&#1073;&#1085;&#1091;&#1083;&#1103;&#1077;&#1084; &#1089;&#1095;&#1105;&#1090;&#1095;&#1080;&#1082; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084; &#1087;&#1086;&#1079;&#1076;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1085;&#1091;&#1090;&#1099;&#1081;
                &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;.</p>
            <pre class="programlisting">
    if (game.matchesNumber == game.cardCount){
        clearInterval(game.timerHandle);
        game.isStarted = false;
        showEndGameModal();
    }
                </pre>
        </div>
    </div>
</div></body></html>